; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v5 ?v1)
		(pred_4 ?v4)
		(pred_1 ?v6)
		(pred_6 ?v6)
		(pred_3 ?v4 ?v6)
		(pred_5)
		(pred_2 ?v4))

   (:action op_3
       :parameters  (?v7 ?v2)
       :precondition (and (not-eq ?v7 ?v2) 
                          (pred_1 ?v7) (pred_1 ?v2) (pred_6 ?v7))
       :effect (and  (pred_6 ?v2)
		     (not (pred_6 ?v7))))


   (:action op_2
       :parameters (?v8 ?v3)
       :precondition  (and  (pred_4 ?v8) (pred_1 ?v3)
			    (pred_3 ?v8 ?v3) (pred_6 ?v3) (pred_5))
       :effect (and (pred_2 ?v8)
		    (not (pred_3 ?v8 ?v3)) 
		    (not (pred_5))))

   (:action op_1
       :parameters  (?v8  ?v3)
       :precondition  (and  (pred_4 ?v8) (pred_1 ?v3)
			    (pred_2 ?v8) (pred_6 ?v3))
       :effect (and (pred_3 ?v8 ?v3)
		    (pred_5)
		    (not (pred_2 ?v8)))))

; problem
(define (problem ferry-l6-c3)
(:domain ferry)
(:objects obj_08 obj_01 obj_09 obj_03 obj_04 obj_05 
          obj_06 obj_02 obj_07 
)
(:init
(pred_1 obj_08)
(pred_1 obj_01)
(pred_1 obj_09)
(pred_1 obj_03)
(pred_1 obj_04)
(pred_1 obj_05)
(pred_4 obj_06)
(pred_4 obj_02)
(pred_4 obj_07)
(not-eq obj_08 obj_01)
(not-eq obj_01 obj_08)
(not-eq obj_08 obj_09)
(not-eq obj_09 obj_08)
(not-eq obj_08 obj_03)
(not-eq obj_03 obj_08)
(not-eq obj_08 obj_04)
(not-eq obj_04 obj_08)
(not-eq obj_08 obj_05)
(not-eq obj_05 obj_08)
(not-eq obj_01 obj_09)
(not-eq obj_09 obj_01)
(not-eq obj_01 obj_03)
(not-eq obj_03 obj_01)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_01)
(not-eq obj_01 obj_05)
(not-eq obj_05 obj_01)
(not-eq obj_09 obj_03)
(not-eq obj_03 obj_09)
(not-eq obj_09 obj_04)
(not-eq obj_04 obj_09)
(not-eq obj_09 obj_05)
(not-eq obj_05 obj_09)
(not-eq obj_03 obj_04)
(not-eq obj_04 obj_03)
(not-eq obj_03 obj_05)
(not-eq obj_05 obj_03)
(not-eq obj_04 obj_05)
(not-eq obj_05 obj_04)
(pred_5)
(pred_3 obj_06 obj_03)
(pred_3 obj_02 obj_08)
(pred_3 obj_07 obj_03)
(pred_6 obj_03)
)
(:goal
(and
(pred_3 obj_06 obj_03)
(pred_3 obj_02 obj_03)
(pred_3 obj_07 obj_03)
)
)

(:constraints
  (sometime-before  (pred_3 obj_02 obj_03) (pred_6 obj_01))
)
)

; plan
1. (op_2 obj_06 obj_03)
   deleted: (pred_3 obj_06 obj_03) (pred_5)
   added: (pred_2 obj_06)
   goals met: 1 of 3
2. (op_3 obj_03 obj_01)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_01)
   goals met: 1 of 3
3. (op_1 obj_06 obj_01)
   deleted: (pred_2 obj_06)
   added: (pred_3 obj_06 obj_01) (pred_5)
   goals met: 1 of 3
4. (op_3 obj_01 obj_08)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_08)
   goals met: 1 of 3
5. (op_2 obj_02 obj_08)
   deleted: (pred_3 obj_02 obj_08) (pred_5)
   added: (pred_2 obj_02)
   goals met: 1 of 3
6. (op_3 obj_08 obj_03)
   deleted: (pred_6 obj_08)
   added: (pred_6 obj_03)
   goals met: 1 of 3
7. (op_1 obj_02 obj_03)
   deleted: (pred_2 obj_02)
   added: (pred_3 obj_02 obj_03) (pred_5)
   goals met: 2 of 3
8. (op_3 obj_03 obj_01)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_01)
   goals met: 2 of 3
9. (op_2 obj_06 obj_01)
   deleted: (pred_3 obj_06 obj_01) (pred_5)
   added: (pred_2 obj_06)
   goals met: 2 of 3
10. (op_3 obj_01 obj_03)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_03)
   goals met: 2 of 3
11. (op_1 obj_06 obj_03)
   deleted: (pred_2 obj_06)
   added: (pred_3 obj_06 obj_03) (pred_5)
   goals met: 3 of 3
